tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/0/topAir/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    minX
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    maxX
    {
        type            fixedValue;
        value           $internalField;
    }
    "(min|max)(Y|Z)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    "topAir_to_.*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
